title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0047 — Event Log Clearing (doppelpaymer)'
id: 6a5bc3db-6505-5093-8082-dacc4051952b
status: deprecated
description: |
  Detects event log clearing associated with doppelpaymer ransomware.
  Incident: dragnet-ransomware-2020-0047
  Ransomware victim claim by doppelpaymer: Afpa; country: FR; sector: Education
  First observed: 2020-04-17.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
