title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0083 — Recovery Inhibition (maze)'
id: 3b654b7d-6a81-545f-9da7-cb40cec4a961
status: deprecated
description: |
  Detects boot/recovery disabling associated with maze ransomware.
  Incident: dragnet-ransomware-2020-0083
  Ransomware victim claim by maze: Canon; country: US; sector: Manufacturing
  First observed: 2020-08-05.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
