title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0012 — Event Log Clearing (conti)'
id: c3a9b008-d423-5585-a04e-19c1f431c820
status: deprecated
description: |
  Detects event log clearing associated with conti ransomware.
  Incident: dragnet-ransomware-2020-0012
  Ransomware victim claim by conti: E.W Wylie of Daseke Inc. (Trucking company); country: US; sector: Transportation/Logistics
  First observed: 2020-10-01.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
