title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0024 — Event Log Clearing (dispossessor)'
id: b4493fc2-3570-5aa5-8478-385fc0cbac2d
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2020-0024
  Ransomware victim claim by dispossessor: arietishealth.com; country: US; sector: Healthcare
  First observed: 2020-03-15.
references:
  - https://dispossessor.com/blogs/28
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
