title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0223 — Shadow Copy Deletion (revil)'
id: d76bf1bf-80e0-5ba6-9f9c-7dff44b4f620
status: deprecated
description: |
  Detects shadow copy deletion commands associated with revil ransomware.
  Incident: dragnet-ransomware-2020-0223
  Ransomware victim claim by revil: Harvest Food Distributors (San Diego); country: US; sector: Agriculture and Food Production
  First observed: 2020-05-03.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
