title: 'Dragnet [Ransomware]: dragnet-ransomware-2020-0157 — Recovery Inhibition (netwalker)'
id: 38a58e60-a89b-5a78-9ed2-f468913c0a06
status: deprecated
description: |
  Detects boot/recovery disabling associated with netwalker ransomware.
  Incident: dragnet-ransomware-2020-0157
  Ransomware victim claim by netwalker: Wilmington Surgical Associates; country: US; sector: Healthcare
  First observed: 2020-10-01.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
