title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0235 — Recovery Inhibition (alphv)'
id: 161a1d81-d2c5-5529-a5f3-5a2849037c09
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0235
  Ransomware victim claim by alphv: SUMITOMO BAKELITE | sbna-inccom; country: JP; sector: Manufacturing
  First observed: 2022-10-27.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/6850c462-1769-4728-86b2-566ebb2e66df
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
