title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1111 — Shadow Copy Deletion (everest)'
id: fa1d7232-8ecc-5f54-b16c-e8b02f2ac314
status: deprecated
description: |
  Detects shadow copy deletion commands associated with everest ransomware.
  Incident: dragnet-ransomware-2022-1111
  Ransomware victim claim by everest: Ledcor; sector: Construction
  First observed: 2022-03-07.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
