title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0188 — Shadow Copy Deletion (alphv)'
id: d8bfb3f2-19fb-5ca0-818e-63e768abb002
status: deprecated
description: |
  Detects shadow copy deletion commands associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0188
  Ransomware victim claim by alphv: Noble Oil | nobleoilcom; sector: Energy
  First observed: 2022-03-09.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/36e6e9d6-e8a3-41d0-9831-a1dbefb500a3
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
