title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0166 — Shadow Copy Deletion (alphv)'
id: 6ddc4851-b896-5eaa-9c2f-30f1953c411d
status: deprecated
description: |
  Detects shadow copy deletion commands associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0166
  Ransomware victim claim by alphv: Maintainco Inc | maintaincocom | starliftcom; sector: Manufacturing
  First observed: 2022-03-22.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
