title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0222 — Recovery Inhibition (alphv)'
id: b044d24f-7b73-5570-8051-d61e59234c49
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0222
  Ransomware victim claim by alphv: Rudsak Inc | rudsakcom; sector: Consumer Services
  First observed: 2022-03-28.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f147f958-caa9-4262-83b3-6e96d48a26d7
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
