title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0202 — Shadow Copy Deletion (alphv)'
id: 72247ec8-a0d1-5179-bffb-684698ce67f0
status: deprecated
description: |
  Detects shadow copy deletion commands associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0202
  Ransomware victim claim by alphv: Phyllis Browning Company | phyllisbrowningcom; sector: Manufacturing
  First observed: 2022-02-18.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/4b4dc9d0-daf8-4527-a983-54440ad8b911
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
