title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0114 — Event Log Clearing (alphv)'
id: e38909a9-fe40-5eb1-8e26-c3aba044cb5e
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0114
  Ransomware victim claim by alphv: Events DC | eventsdccom; sector: Hospitality and Tourism
  First observed: 2022-10-14.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc4a2074-d980-48a9-b0c1-aa53681cb89a
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
