title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0114 — Recovery Inhibition (alphv)'
id: f9e6b2f5-2cc9-58f5-83a4-72809e472386
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0114
  Ransomware victim claim by alphv: Events DC | eventsdccom; sector: Hospitality and Tourism
  First observed: 2022-10-14.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc4a2074-d980-48a9-b0c1-aa53681cb89a
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
