title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0142 — Event Log Clearing (alphv)'
id: 91fb0ad5-c397-517b-8bb4-e92f2b9f7d70
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0142
  Ransomware victim claim by alphv: inibsacom | inibsadentalcom | inibsanet 2TB FULL DATA; sector: Healthcare
  First observed: 2022-03-22.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52c61db9-f2e2-4cef-b69a-f75c5e8693a7
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
