title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1036 — Event Log Clearing (dispossessor)'
id: 73b1c8cb-1647-5a66-91cf-323a59fcbbb7
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2022-1036
  Ransomware victim claim by dispossessor: nasco.com; sector: Healthcare
  First observed: 2022-12-20.
references:
  - https://dispossessor.com/blogs/140
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
