title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0193 — Shadow Copy Deletion (alphv)'
id: 0975c6fa-9f31-568a-8c54-43efeb743827
status: deprecated
description: |
  Detects shadow copy deletion commands associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0193
  Ransomware victim claim by alphv: NorthEast Coverages | northeastcoveragescom; sector: Business Services
  First observed: 2022-02-09.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/a1ca2fb8-efde-4932-bbf3-f5d7ee8acc00
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
