title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0353 — Recovery Inhibition (bianlian)'
id: 852e39c1-1386-5295-92ac-aeeba3d0dc43
status: deprecated
description: |
  Detects boot/recovery disabling associated with bianlian ransomware.
  Incident: dragnet-ransomware-2022-0353
  Ransomware victim claim by bianlian: Gazelle International Ltd; sector: Not Found
  First observed: 2022-11-24.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
