title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1064 — Recovery Inhibition (dispossessor)'
id: 3d3e3acd-3474-55e2-8006-ae1a82a88fe2
status: deprecated
description: |
  Detects boot/recovery disabling associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2022-1064
  Ransomware victim claim by dispossessor: zurifurniture.com; sector: Business Services
  First observed: 2022-10-30.
references:
  - https://dispossessor.com/blogs/352
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
