title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0114 — Shadow Copy Deletion (alphv)'
id: 2088affe-cb39-5eea-b449-7f7403a269b7
status: deprecated
description: |
  Detects shadow copy deletion commands associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0114
  Ransomware victim claim by alphv: Events DC | eventsdccom; sector: Hospitality and Tourism
  First observed: 2022-10-14.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc4a2074-d980-48a9-b0c1-aa53681cb89a
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
