title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2875 — Recovery Inhibition (royal)'
id: d42c325b-0298-5fcd-be40-08e178f358a9
status: deprecated
description: |
  Detects boot/recovery disabling associated with royal ransomware.
  Incident: dragnet-ransomware-2022-2875
  Ransomware victim claim by royal: https://www.prioritypower.net; sector: Energy
  First observed: 2022-11-04.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
