title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0211 — Event Log Clearing (alphv)'
id: 2bedae50-f9c1-56b9-9e35-539cd6345ee3
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0211
  Ransomware victim claim by alphv: Quantel Medical | quantel-medicalcom; sector: Healthcare
  First observed: 2022-02-18.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f40fa4ec-80a9-4741-9746-320f278aa71c
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
