title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0246 — Recovery Inhibition (alphv)'
id: a8aefa48-f51b-59a4-8cef-f2a781d9dd31
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0246
  Ransomware victim claim by alphv: The People's Federal Credit Union | tpfcucom; sector: Financial Services
  First observed: 2022-05-09.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc6d70e6-164f-43f0-81fe-16fdeb257ff6
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
