title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0224 — Event Log Clearing (alphv)'
id: 38293e2f-bc9e-5182-a91d-b53fd2a5ccbc
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0224
  Ransomware victim claim by alphv: Scherr Legate | scherrlegatecom; sector: Business Services
  First observed: 2022-02-08.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52f40157-5e7a-471d-9339-c5f9e051f293
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
