title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0270 — Event Log Clearing (arvinclub)'
id: 0762a78e-e7c9-5ffa-8277-62e7bfcaa3fd
status: deprecated
description: |
  Detects event log clearing associated with arvinclub ransomware.
  Incident: dragnet-ransomware-2022-0270
  Ransomware victim claim by arvinclub: AM International; sector: Manufacturing
  First observed: 2022-04-20.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
