title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0222 — Event Log Clearing (alphv)'
id: bdf7bf02-7889-56d4-9cef-9871f36694d8
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0222
  Ransomware victim claim by alphv: Rudsak Inc | rudsakcom; sector: Consumer Services
  First observed: 2022-03-28.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f147f958-caa9-4262-83b3-6e96d48a26d7
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
