title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0202 — Recovery Inhibition (alphv)'
id: 6a77400d-0697-58aa-a7ce-ef5dc274b507
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0202
  Ransomware victim claim by alphv: Phyllis Browning Company | phyllisbrowningcom; sector: Manufacturing
  First observed: 2022-02-18.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/4b4dc9d0-daf8-4527-a983-54440ad8b911
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
