title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0171 — Recovery Inhibition (alphv)'
id: 33ab5c3f-290a-5dff-9f66-8cf4aed8c32a
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0171
  Ransomware victim claim by alphv: Medical Staff | medicalstaff.com.au; country: AU; sector: Healthcare
  First observed: 2022-02-13.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
