title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0070 — Recovery Inhibition (alphv)'
id: 8cbd3444-bdf8-53e3-bc10-739aea783cdc
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0070
  Ransomware victim claim by alphv: Bullfrog International | bullfrogspascom; sector: Consumer Services
  First observed: 2022-03-15.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/dacee923-0f18-4bd9-9ecc-24cb89fa73bf
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
