title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2162 — Event Log Clearing (lockbit3)'
id: 3629c4e2-4de6-5190-9375-d0d4be86436e
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2022-2162
  Ransomware victim claim by lockbit3: floresfunza.com; sector: Consumer Services
  First observed: 2022-09-04.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
