title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0193 — Event Log Clearing (alphv)'
id: cfda2b9d-5dd9-5857-a156-2ca552af5f1c
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0193
  Ransomware victim claim by alphv: NorthEast Coverages | northeastcoveragescom; sector: Business Services
  First observed: 2022-02-09.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/a1ca2fb8-efde-4932-bbf3-f5d7ee8acc00
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
