title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-3122 — Event Log Clearing (vicesociety)'
id: 8ec51c3d-0897-5a33-8b2b-7375cdf6d27d
status: deprecated
description: |
  Detects event log clearing associated with vicesociety ransomware.
  Incident: dragnet-ransomware-2022-3122
  Ransomware victim claim by vicesociety: ROC Mondriaan; sector: Not Found
  First observed: 2022-01-06.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
