title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0166 — Event Log Clearing (alphv)'
id: ce3318f5-0ec5-5ecd-a204-aceda35aa29d
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0166
  Ransomware victim claim by alphv: Maintainco Inc | maintaincocom | starliftcom; sector: Manufacturing
  First observed: 2022-03-22.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
