title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0224 — Recovery Inhibition (alphv)'
id: a4ef29d3-db6f-545d-a1ba-44a68ef81766
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0224
  Ransomware victim claim by alphv: Scherr Legate | scherrlegatecom; sector: Business Services
  First observed: 2022-02-08.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52f40157-5e7a-471d-9339-c5f9e051f293
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
