title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1199 — Recovery Inhibition (hive)'
id: c023b4ac-e7a1-5db8-bca0-336fc34a38b9
status: deprecated
description: |
  Detects boot/recovery disabling associated with hive ransomware.
  Incident: dragnet-ransomware-2022-1199
  Ransomware victim claim by hive: ChemStation International; country: US; sector: Manufacturing
  First observed: 2022-05-26.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
