title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1486 — Shadow Copy Deletion (lockbit2)'
id: 8e9f39a4-36ba-5cdc-b103-0770ee9f4f50
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2022-1486
  Ransomware victim claim by lockbit2: axessa.ch; country: CH; sector: Technology
  First observed: 2022-03-29.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
