title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1008 — Shadow Copy Deletion (dataleak)'
id: 5ba11030-b685-54f1-b818-9246af21425d
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dataleak ransomware.
  Incident: dragnet-ransomware-2022-1008
  Ransomware victim claim by dataleak: nissin.com.br Disclose the compressed package password; sector: Agriculture and Food Production
  First observed: 2022-12-02.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
