title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0246 — Event Log Clearing (alphv)'
id: 3cc309af-4806-5fcf-afe7-4add1bcebe3e
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0246
  Ransomware victim claim by alphv: The People's Federal Credit Union | tpfcucom; sector: Financial Services
  First observed: 2022-05-09.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/bc6d70e6-164f-43f0-81fe-16fdeb257ff6
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
