title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0122 — Event Log Clearing (alphv)'
id: 2b3ab6f7-3777-5381-ac8c-624c45649808
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0122
  Ransomware victim claim by alphv: GEMS Education | gemseducationcom; sector: Education
  First observed: 2022-02-25.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/37227f9e-1402-4d49-83ea-8fb16319f78d
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
