title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0142 — Recovery Inhibition (alphv)'
id: 63021ad4-a7f9-5773-8e10-73fb445035b3
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0142
  Ransomware victim claim by alphv: inibsacom | inibsadentalcom | inibsanet 2TB FULL DATA; sector: Healthcare
  First observed: 2022-03-22.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/52c61db9-f2e2-4cef-b69a-f75c5e8693a7
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
