title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-1361 — Recovery Inhibition (karakurt)'
id: de29e271-17b5-5c58-9383-2462dbd4753b
status: deprecated
description: |
  Detects boot/recovery disabling associated with karakurt ransomware.
  Incident: dragnet-ransomware-2022-1361
  Ransomware victim claim by karakurt: BauVal; sector: Construction
  First observed: 2022-12-11.
references:
  - https://3f7nxkjway3d223j27lyad7v5cgmyaifesycvmwq7i7cbs23lb6llryd.onion/companies/f31934e6-6a77-408d-8d5c-91947865c97e
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
