title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0166 — Recovery Inhibition (alphv)'
id: ba6b09ba-7e3a-577d-af19-cf4b9980b670
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0166
  Ransomware victim claim by alphv: Maintainco Inc | maintaincocom | starliftcom; sector: Manufacturing
  First observed: 2022-03-22.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/22988430-0867-466c-815e-331e08266b66
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
