title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0061 — Recovery Inhibition (alphv)'
id: 08028a38-3668-51a2-9416-25d29e7c580c
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0061
  Ransomware victim claim by alphv: bet9jacom | goldbetit; sector: Consumer Services
  First observed: 2022-04-06.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/683f74fc-b6b4-4de6-9c20-2886a956bcaf
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
