title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-0211 — Recovery Inhibition (alphv)'
id: 4caeb223-2415-57bb-9926-2827e64905d7
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2022-0211
  Ransomware victim claim by alphv: Quantel Medical | quantel-medicalcom; sector: Healthcare
  First observed: 2022-02-18.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/f40fa4ec-80a9-4741-9746-320f278aa71c
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
