title: 'Dragnet [Ransomware]: dragnet-ransomware-2022-2399 — Shadow Copy Deletion (lockbit3)'
id: 15a230c8-489b-579f-86f1-2a7f93a98705
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2022-2399
  Ransomware victim claim by lockbit3: thezincgroup.com; sector: Manufacturing
  First observed: 2022-09-14.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
