title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4426 — Event Log Clearing (play)'
id: a1fdfff7-edec-541d-85c8-e75b9f1617cb
status: deprecated
description: |
  Detects event log clearing associated with play ransomware.
  Incident: dragnet-ransomware-2024-4426
  Ransomware victim claim by play: Parker Development Company; country: US; sector: Business Services
  First observed: 2024-08-09.
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=DWjMlz99ykTPuA
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
