title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1400 — Recovery Inhibition (cactus)'
id: 432d119b-29b4-53be-bc9f-4f26bfd54477
status: deprecated
description: |
  Detects boot/recovery disabling associated with cactus ransomware.
  Incident: dragnet-ransomware-2024-1400
  Ransomware victim claim by cactus: leonardssyrups.com; country: US; sector: Business Services
  First observed: 2024-07-05.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/LEONARDDOMAIN
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
