title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2486 — Recovery Inhibition (hunters)'
id: 5dc243c1-fe9a-5f9a-b568-11ff4871d318
status: deprecated
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2486
  Ransomware victim claim by hunters: ACE Air Cargo; country: US; sector: Transportation/Logistics
  First observed: 2024-03-09.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/6703254697
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
