title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3424 — Recovery Inhibition (lockbit3)'
id: c1140d7f-ecb4-51c4-b6fa-7acd34848e9e
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2024-3424
  Ransomware victim claim by lockbit3: piedmonthoist.com; country: US; sector: Manufacturing
  First observed: 2024-07-17.
references:
  - http://lockbit3753ekiocyo5epmpy6klmejchjtzddoekjlnt6mu3qh4de2id.onion//post/UEPxhaaOP3d8u69c6697caa83cf12
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
