title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2702 — Recovery Inhibition (hunters)'
id: b3132dbf-13c2-5a2b-95e6-9cfbe80455d5
status: deprecated
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2702
  Ransomware victim claim by hunters: Therapeutic Health Services; country: US; sector: Healthcare
  First observed: 2024-03-19.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/0837003213
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
