title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0761 — Recovery Inhibition (bianlian)'
id: 6d642fc0-7fa4-5265-bcd0-cc7fb949448a
status: deprecated
description: |
  Detects boot/recovery disabling associated with bianlian ransomware.
  Incident: dragnet-ransomware-2024-0761
  Ransomware victim claim by bianlian: Advantage Orthopedic & Sports Medicine Clinic; country: US; sector: Healthcare
  First observed: 2024-02-15.
references:
  - http://bianlianlbc5an4kgnay3opdemgcryg2kpfcbgczopmm3dnbz3uaunad.onion//companies/advantageorthopedic.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
