title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1410 — Event Log Clearing (cactus)'
id: 26ef878b-c2b3-51cc-8792-ef96785ff8a0
status: deprecated
description: |
  Detects event log clearing associated with cactus ransomware.
  Incident: dragnet-ransomware-2024-1410
  Ransomware victim claim by cactus: northernresponse.com; country: CA; sector: Consumer Services
  First observed: 2024-01-17.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/NRESPONSE
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
