title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1833 — Event Log Clearing (donutleaks)'
id: 38d10fb7-8854-5593-8171-c87250394e65
status: deprecated
description: |
  Detects event log clearing associated with donutleaks ransomware.
  Incident: dragnet-ransomware-2024-1833
  Ransomware victim claim by donutleaks: DOD contractors you are welcome in our chat.; country: US; sector: Public Sector
  First observed: 2024-02-04.
references:
  - http://sbc2zv2qnz5vubwtx3aobfpkeao6l4igjegm3xx7tk5suqhjkp5jxtqd.onion/dod-contractors-you-are-welcome-in-our-chat/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
