title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1955 — Event Log Clearing (dragonransomware)'
id: 14933d2f-2253-538d-bc7c-97993a1c2617
status: deprecated
description: |
  Detects event log clearing associated with dragonransomware ransomware.
  Incident: dragnet-ransomware-2024-1955
  Ransomware victim claim by dragonransomware: salesmandiary.com; country: IN; sector: Business Services
  First observed: 2024-10-26.
references:
  - https://t.me/DragonRansom/332
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
