title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3873 — Recovery Inhibition (medusa)'
id: cc53e5a1-524e-5aaa-8e79-aad0b9944595
status: deprecated
description: |
  Detects boot/recovery disabling associated with medusa ransomware.
  Incident: dragnet-ransomware-2024-3873
  Ransomware victim claim by medusa: Penn Cinema ; country: US; sector: Business Services
  First observed: 2024-02-26.
references:
  - http://medusaxko7jxtrojdkxo66j7ck4q5tgktf7uqsqyfry4ebnxlcbkccyd.onion/detail?id=7b1570ebe840f4fcd3ed6115d7ceeeb8
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
