title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3443 — Event Log Clearing (lockbit3)'
id: 561ac7ce-eaf0-5042-b216-967701e52fcf
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2024-3443
  Ransomware victim claim by lockbit3: rajawali.com; country: ID; sector: Hospitality and Tourism
  First observed: 2024-02-13.
references:
  - http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/mBIMu0vMBfy4MUCj65cbd0aba4648
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
