title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1391 — Shadow Copy Deletion (cactus)'
id: 133706f2-d09c-56be-88f9-0aeadabf7c57
status: deprecated
description: |
  Detects shadow copy deletion commands associated with cactus ransomware.
  Incident: dragnet-ransomware-2024-1391
  Ransomware victim claim by cactus: hacla.org; country: US; sector: Public Sector
  First observed: 2024-10-01.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/HACLA
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
