title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2524 — Event Log Clearing (hunters)'
id: 980ca6ef-05ba-591a-a4bf-617a11b1a4fc
status: deprecated
description: |
  Detects event log clearing associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2524
  Ransomware victim claim by hunters: BNBuilders; country: US; sector: Business Services
  First observed: 2024-10-05.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/7400493736
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
