title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2400 — Recovery Inhibition (handala)'
id: 80d240ec-687c-50c9-b8c7-eeb086efebb6
status: deprecated
description: |
  Detects boot/recovery disabling associated with handala ransomware.
  Incident: dragnet-ransomware-2024-2400
  Ransomware victim claim by handala: Handala’s attack on Israeli organizations; country: IL; sector: Public Sector
  First observed: 2024-07-21.
references:
  - https://handala.to/handalas-attack-on-israeli-organizations/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
