title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2562 — Event Log Clearing (hunters)'
id: 891ee0ae-5229-56b4-bf9a-de00c8d5a1ef
status: deprecated
description: |
  Detects event log clearing associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2562
  Ransomware victim claim by hunters: DJH Jugendherberge; country: DE; sector: Hospitality and Tourism
  First observed: 2024-09-18.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/4465332338
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
