title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1990 — Shadow Copy Deletion (ElDorado)'
id: f422667b-08b7-5683-8cbf-c55146b1c405
status: deprecated
description: |
  Detects shadow copy deletion commands associated with ElDorado ransomware.
  Incident: dragnet-ransomware-2024-1990
  Ransomware victim claim by ElDorado: ANKERSKA PLOVIDBA d.d.; country: HR; sector: Transportation/Logistics
  First observed: 2024-02-11.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
