title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1012 — Event Log Clearing (blackbasta)'
id: 58ce19cb-c5c0-580b-ab35-35caae172bcb
status: deprecated
description: |
  Detects event log clearing associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2024-1012
  Ransomware victim claim by blackbasta: jonti-craft.com; country: US; sector: Manufacturing
  First observed: 2024-10-18.
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=jonti-craft.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
