title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4510 — Recovery Inhibition (play)'
id: f5c43b31-7e28-5164-966a-01204b13840e
status: deprecated
description: |
  Detects boot/recovery disabling associated with play ransomware.
  Incident: dragnet-ransomware-2024-4510
  Ransomware victim claim by play: The SMS Group; country: US; sector: Manufacturing
  First observed: 2024-08-16.
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=JVtNLPKqV4chNp
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
