title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2648 — Shadow Copy Deletion (hunters)'
id: 677f5554-8fe1-54cc-a090-5d4debe309e6
status: deprecated
description: |
  Detects shadow copy deletion commands associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2648
  Ransomware victim claim by hunters: Notions Marketing; country: US; sector: Business Services
  First observed: 2024-04-12.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/9287271819
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
