title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-5376 — Recovery Inhibition (ransomhub)'
id: 92b92bbe-177c-5aca-a302-760d0289343a
status: deprecated
description: |
  Detects boot/recovery disabling associated with ransomhub ransomware.
  Incident: dragnet-ransomware-2024-5376
  Ransomware victim claim by ransomhub: www.leaguecenter.org; country: US; sector: Education
  First observed: 2024-12-07.
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/18e76969-e4bb-421a-9f54-50e018c6667c/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
