title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2669 — Recovery Inhibition (hunters)'
id: 11ac7dd2-50c9-5d59-b7ea-9dc6aee93e98
status: deprecated
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2669
  Ransomware victim claim by hunters: Ribe-Groupe; country: FR; sector: Business Services
  First observed: 2024-02-16.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/0092133521
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
