title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0275 — Shadow Copy Deletion (akira)'
id: c235a98f-7fa7-56ff-a574-75aaa093ce29
status: deprecated
description: |
  Detects shadow copy deletion commands associated with akira ransomware.
  Incident: dragnet-ransomware-2024-0275
  Ransomware victim claim by akira: DENHAM the Jeanmaker; country: NL; sector: Business Services
  First observed: 2024-01-17.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
