title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1444 — Event Log Clearing (cactus)'
id: 7db3b75c-d73b-5534-953e-f7062db67251
status: deprecated
description: |
  Detects event log clearing associated with cactus ransomware.
  Incident: dragnet-ransomware-2024-1444
  Ransomware victim claim by cactus: www.amchar.com; country: US; sector: Business Services
  First observed: 2024-09-17.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/AMCHAR2
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
