title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4734 — Recovery Inhibition (qilin)'
id: dbe1ee7d-8e9b-5a3a-820a-ace6d4f7ae42
status: deprecated
description: |
  Detects boot/recovery disabling associated with qilin ransomware.
  Incident: dragnet-ransomware-2024-4734
  Ransomware victim claim by qilin: ptsmi.co.id; country: ID; sector: Manufacturing
  First observed: 2024-03-21.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
