title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2641 — Shadow Copy Deletion (hunters)'
id: c22abaae-90ad-5fd5-9635-b0e26432f326
status: deprecated
description: |
  Detects shadow copy deletion commands associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2641
  Ransomware victim claim by hunters: NetOne; country: ZW; sector: Business Services
  First observed: 2024-07-03.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/7338036485
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
