title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-5106 — Shadow Copy Deletion (ransomhub)'
id: 3f31cf35-ac89-5fd5-992c-68a348ec857c
status: deprecated
description: |
  Detects shadow copy deletion commands associated with ransomhub ransomware.
  Incident: dragnet-ransomware-2024-5106
  Ransomware victim claim by ransomhub: modernceramics.com; country: US; sector: Manufacturing
  First observed: 2024-08-02.
references:
  - http://ransomxifxwc5eteopdobynonjctkxxvap77yqifu2emfbecgbqdw6qd.onion/2ffcb584-9f1c-40cd-9da9-2553c4030188/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
