title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0972 — Event Log Clearing (blackbasta)'
id: 1ad0b319-be7d-5790-9c8f-c58730ac85ab
status: deprecated
description: |
  Detects event log clearing associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2024-0972
  Ransomware victim claim by blackbasta: doyon.com | doyondrilling.com; country: US; sector: Energy
  First observed: 2024-04-02.
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=doyon.com%20|%20doyondrilling.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
