title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0972 — Recovery Inhibition (blackbasta)'
id: d499c583-47e8-527a-a481-4eaa6f65708e
status: deprecated
description: |
  Detects boot/recovery disabling associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2024-0972
  Ransomware victim claim by blackbasta: doyon.com | doyondrilling.com; country: US; sector: Energy
  First observed: 2024-04-02.
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=doyon.com%20|%20doyondrilling.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
