title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3841 — Shadow Copy Deletion (medusa)'
id: eead039e-ecd4-5420-8b15-2b3db3d94776
status: deprecated
description: |
  Detects shadow copy deletion commands associated with medusa ransomware.
  Incident: dragnet-ransomware-2024-3841
  Ransomware victim claim by medusa: LEGO Construction Co; country: US; sector: Business Services
  First observed: 2024-11-15.
references:
  - http://cx5u7zxbvrfyoj6ughw76oa264ucuuizmmzypwum6ear7pct4yc723qd.onion/detail?id=6642f105523f15128858bf9fd8bcf670
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
