title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3448 — Recovery Inhibition (lockbit3)'
id: 9155650f-36c6-5bac-bd4e-f4e075cd8430
status: deprecated
description: |
  Detects boot/recovery disabling associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2024-3448
  Ransomware victim claim by lockbit3: rehab.ie; country: IE; sector: Healthcare
  First observed: 2024-04-17.
references:
  - http://lockbit3olp7oetlc4tl5zydnoluphh7fvdt5oa6arcp2757r7xkutid.onion/post/r8VSf9lhRa5S7pYF661f1894b0ccb
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
