title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0543 — Recovery Inhibition (alphv)'
id: 54d9d9a3-f2d7-5ab9-ac6a-7ffd9d0900d7
status: deprecated
description: |
  Detects boot/recovery disabling associated with alphv ransomware.
  Incident: dragnet-ransomware-2024-0543
  Ransomware victim claim by alphv: Allan Berger & Associates; country: US; sector: Business Services
  First observed: 2024-02-29.
references:
  - http://alphvuzxyxv6ylumd2ngp46xzq3pw6zflomrghvxeuks6kklberrbmyd.onion/f82a2b6c-3174-4e96-ad2a-007e4977269f
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
