title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-3861 — Shadow Copy Deletion (medusa)'
id: 87a62fac-439f-5e6e-95b5-8bc55ae8182b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with medusa ransomware.
  Incident: dragnet-ransomware-2024-3861
  Ransomware victim claim by medusa: North Los Angeles County Regional Center; country: US; sector: Public Sector
  First observed: 2024-12-12.
references:
  - http://xfv4jzckytb4g3ckwemcny3ihv4i5p4lqzdpi624cxisu35my5fwi5qd.onion/detail?id=e0a322247face6f5b634c8fce838a460
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
