title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1955 — Recovery Inhibition (dragonransomware)'
id: c53cc6bb-17f3-56d6-8f24-93d134e3b9fe
status: deprecated
description: |
  Detects boot/recovery disabling associated with dragonransomware ransomware.
  Incident: dragnet-ransomware-2024-1955
  Ransomware victim claim by dragonransomware: salesmandiary.com; country: IN; sector: Business Services
  First observed: 2024-10-26.
references:
  - https://t.me/DragonRansom/332
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
