title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4278 — Shadow Copy Deletion (play)'
id: 77b81360-b442-5d8a-8cbf-540cb862ae5b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with play ransomware.
  Incident: dragnet-ransomware-2024-4278
  Ransomware victim claim by play: Elmhurst Group; country: US; sector: Business Services
  First observed: 2024-05-09.
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=H4Hfdv48y8bkK
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
