title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1943 — Event Log Clearing (dragonransomware)'
id: 6ef9da5d-3977-5c36-b3b5-d7ef40d0a14e
status: deprecated
description: |
  Detects event log clearing associated with dragonransomware ransomware.
  Incident: dragnet-ransomware-2024-1943
  Ransomware victim claim by dragonransomware: hinodes.in; country: IN; sector: Transportation/Logistics
  First observed: 2024-12-05.
references:
  - https://t.me/DragonRansom/419
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
