title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-0975 — Event Log Clearing (blackbasta)'
id: 400f2b2b-2e98-5593-af49-7e976d9e1dc5
status: deprecated
description: |
  Detects event log clearing associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2024-0975
  Ransomware victim claim by blackbasta: duvel.com | boulevard.com; country: BE; sector: Agriculture and Food Production
  First observed: 2024-03-12.
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=duvel.com%20|%20boulevard.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
