title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4647 — Shadow Copy Deletion (qilin)'
id: 0c025987-9710-549f-92b5-8126767a9a10
status: deprecated
description: |
  Detects shadow copy deletion commands associated with qilin ransomware.
  Incident: dragnet-ransomware-2024-4647
  Ransomware victim claim by qilin: Freyberg Petroleum; country: US; sector: Energy
  First observed: 2024-10-25.
references:
  - http://kbsqoivihgdmwczmxkbovk7ss2dcynitwhhfu5yw725dboqo5kthfaad.onion/site/view?uuid=0418833f-c865-37dc-9b4b-dc96472c3fe6
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
