title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2679 — Recovery Inhibition (hunters)'
id: 0b751f12-dfc2-56ec-b77e-74144718a7ef
status: deprecated
description: |
  Detects boot/recovery disabling associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2679
  Ransomware victim claim by hunters: Schuster Trucking Company; country: US; sector: Transportation/Logistics
  First observed: 2024-02-15.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/1377600756
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
