title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-1820 — Shadow Copy Deletion (dispossessor)'
id: 64905998-a1c0-5c3e-a3ac-a23a369cfc56
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2024-1820
  Ransomware victim claim by dispossessor: umaps.hn; country: HN; sector: Technology
  First observed: 2024-03-20.
references:
  - https://dispossessor.com/blogs/1358
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
