title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2542 — Shadow Copy Deletion (hunters)'
id: 4b6a9378-dd54-57a0-afa1-d3356f6f9e7c
status: deprecated
description: |
  Detects shadow copy deletion commands associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2542
  Ransomware victim claim by hunters: City of St. Cloud, Florida; country: US; sector: Public Sector
  First observed: 2024-04-16.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/1646187227
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
