title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2701 — Shadow Copy Deletion (hunters)'
id: d54f4855-3b4a-5d33-b6f1-f50f2840cf46
status: deprecated
description: |
  Detects shadow copy deletion commands associated with hunters ransomware.
  Incident: dragnet-ransomware-2024-2701
  Ransomware victim claim by hunters: Therabel Lucien Pharma SAS; country: FR; sector: Healthcare
  First observed: 2024-09-01.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/2463662316
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
