title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-4461 — Shadow Copy Deletion (play)'
id: b5955227-bbab-51bf-aee3-59388243898a
status: deprecated
description: |
  Detects shadow copy deletion commands associated with play ransomware.
  Incident: dragnet-ransomware-2024-4461
  Ransomware victim claim by play: Refcio & Associates; country: CA; sector: Not Found
  First observed: 2024-05-05.
references:
  - http://k7kg3jqxang3wh7hnmaiokchk7qoebupfgoik6rha6mjpzwupwtj25yd.onion/topic.php?id=4EJ2SL66rc1kwb
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
