title: 'Dragnet [Ransomware]: dragnet-ransomware-2024-2772 — Shadow Copy Deletion (incransom)'
id: 55c5189b-2053-5990-ab11-d128f55a43ed
status: deprecated
description: |
  Detects shadow copy deletion commands associated with incransom ransomware.
  Incident: dragnet-ransomware-2024-2772
  Ransomware victim claim by incransom: drmsusa.com; country: US; sector: Business Services
  First observed: 2024-05-18.
references:
  - http://incblog6qu4y4mm4zvw5nrmue6qbwtgjsxpw6b7ixzssu36tsajldoad.onion/blog/disclosures/6648686ab24e38251bc39b88
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
