title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-4498 — Shadow Copy Deletion (nightspire)'
id: 60c057c0-8fc1-59c5-a544-7610953faed2
status: deprecated
description: |
  Detects shadow copy deletion commands associated with nightspire ransomware.
  Incident: dragnet-ransomware-2025-4498
  Ransomware victim claim by nightspire: Calcadawines; country: PT; sector: Agriculture and Food Production
  First observed: 2025-05-23.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
