title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7666 — Shadow Copy Deletion (thegentlemen)'
id: 4e3c4198-cfc0-5fcb-ad86-d1427d109bad
status: deprecated
description: |
  Detects shadow copy deletion commands associated with thegentlemen ransomware.
  Incident: dragnet-ransomware-2025-7666
  Ransomware victim claim by thegentlemen: Takedown request #1798; country: FR; sector: Technology
  First observed: 2025-07-14.
references:
  - http://tezwsse5czllksjb7cwp65rvnk4oobmzti2znn42i43bjdfd2prqqkad.onion
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
