title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7448 — Recovery Inhibition (spacebears)'
id: 76182248-5460-5fd3-a3a7-bf8344dcfc9f
status: deprecated
description: |
  Detects boot/recovery disabling associated with spacebears ransomware.
  Incident: dragnet-ransomware-2025-7448
  Ransomware victim claim by spacebears: EBL PARTNERS (construction|interiors), Florida; country: US; sector: Business Services
  First observed: 2025-01-08.
references:
  - http://5butbkrljkaorg5maepuca25oma7eiwo6a2rlhvkblb4v6mf3ki2ovid.onion/companies/29/ebl-partners-constructioninteriors-florida
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
