title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-2595 — Shadow Copy Deletion (dragonforce)'
id: 817c56f7-8b29-5deb-b072-6e29a891074c
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dragonforce ransomware.
  Incident: dragnet-ransomware-2025-2595
  Ransomware victim claim by dragonforce: Trackside Services; country: US; sector: Transportation/Logistics
  First observed: 2025-06-17.
references:
  - http://z3wqggtxft7id3ibr7srivv5gjof5fwg76slewnzwwakjuf3nlhukdid.onion/blog/?post_uuid=eb7facea-6cbe-4a24-8b4d-b9086ef8e089
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
