title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0855 — Recovery Inhibition (apos)'
id: 87a9d029-64ee-57f5-a8f5-63919fed06fc
status: deprecated
description: |
  Detects boot/recovery disabling associated with apos ransomware.
  Incident: dragnet-ransomware-2025-0855
  Ransomware victim claim by apos: Lawton Partners; country: CA; sector: Financial Services
  First observed: 2025-06-12.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
