title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6124 — Shadow Copy Deletion (qilin)'
id: 31816c74-9ef1-5793-9338-650cc908c3a3
status: deprecated
description: |
  Detects shadow copy deletion commands associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-6124
  Ransomware victim claim by qilin: Vishnick McGovern Milizio; country: US; sector: Not Found
  First observed: 2025-12-13.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=af5b143b-5318-3250-8724-49288dc9c5ed
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
