title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5039 — Recovery Inhibition (play)'
id: 51fb7367-81da-5d24-9cb8-0e48976a63ef
status: deprecated
description: |
  Detects boot/recovery disabling associated with play ransomware.
  Incident: dragnet-ransomware-2025-5039
  Ransomware victim claim by play: Mainline Information Systems; country: US; sector: Technology
  First observed: 2025-02-11.
references:
  - http://mbrlkbtq5jonaqkurjwmxftytyn2ethqvbxfu4rgjbkkknndqwae6byd.onion/index.php?page=1topic.php?id=OydGn7MyywWB8
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
