title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6810 — Event Log Clearing (safepay)'
id: 5084853d-f6cd-5cf4-8fe0-d82d279bf86a
status: deprecated
description: |
  Detects event log clearing associated with safepay ransomware.
  Incident: dragnet-ransomware-2025-6810
  Ransomware victim claim by safepay: igpi.co.jp; country: JP; sector: Business Services
  First observed: 2025-03-31.
references:
  - http://j3dp6okmaklajrsk6zljl5sfa2vpui7j2w6cwmhmmqhab6frdfbphhid.onion#igpi.co.jp
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
