title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3625 — Recovery Inhibition (J)'
id: ebb49a03-c725-50c0-8970-bae79cd85716
status: deprecated
description: |
  Detects boot/recovery disabling associated with J ransomware.
  Incident: dragnet-ransomware-2025-3625
  Ransomware victim claim by J: a********p.com; sector: Not Found
  First observed: 2025-08-13.
references:
  - http://twniiyed6mydtbe64i5mdl56nihl7atfaqtpww6gqyaiohgc75apzpad.onion/posts/689d83580b175cbc06955d85/689d83580b175cbc06955d85/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
