title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-4743 — Recovery Inhibition (payoutsking)'
id: 6b76a223-5f97-58eb-a973-6897132c1485
status: deprecated
description: |
  Detects boot/recovery disabling associated with payoutsking ransomware.
  Incident: dragnet-ransomware-2025-4743
  Ransomware victim claim by payoutsking: Klüber Lubrication; country: DE; sector: Manufacturing
  First observed: 2025-11-17.
references:
  - https:/payoutsgn7cy6uliwevdqspncjpfxpmzgirwl2au65la7rfs5x3qnbqd.onion/post/5qgLmp6Wa2HxPmaQi53v
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
