title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7348 — Event Log Clearing (sinobi)'
id: c7d47744-11f7-5cad-83fb-bf8502936a9e
status: deprecated
description: |
  Detects event log clearing associated with sinobi ransomware.
  Incident: dragnet-ransomware-2025-7348
  Ransomware victim claim by sinobi: MSC-Wireless; country: GB; sector: Telecommunication
  First observed: 2025-10-20.
references:
  - http://sinobi6ftrg27d6g4sjdt65malds6cfptlnjyw52rskakqjda6uvb7yd.onion/leaks/68f6955c88b6823fa2b6b4bf
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
