title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7061 — Shadow Copy Deletion (sarcoma)'
id: 9f29e22b-4426-57fc-88f5-8c3ac8853f72
status: deprecated
description: |
  Detects shadow copy deletion commands associated with sarcoma ransomware.
  Incident: dragnet-ransomware-2025-7061
  Ransomware victim claim by sarcoma: MACMA Werbeartikel oHG; country: DE; sector: Business Services
  First observed: 2025-09-25.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
