title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-1022 — Recovery Inhibition (babuk2)'
id: baf39797-8a02-5b62-804a-46fcdc80b476
status: deprecated
description: |
  Detects boot/recovery disabling associated with babuk2 ransomware.
  Incident: dragnet-ransomware-2025-1022
  Ransomware victim claim by babuk2: pureincubation.com; country: US; sector: Technology
  First observed: 2025-03-28.
references:
  - http:/bxwu33iefqfc3rxigynn3ghvq4gdw3gxgxna5m4aa3o4vscdeeqhiqad.onion/blog/aca6f28085ad9c62056267f1ed82b5ae0da3a3b9ef4d30654028306e7ae7892d/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
