title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3155 — Recovery Inhibition (IMNCrew)'
id: d3df7de6-22fa-5006-a9a5-4611d4553965
status: deprecated
description: |
  Detects boot/recovery disabling associated with IMNCrew ransomware.
  Incident: dragnet-ransomware-2025-3155
  Ransomware victim claim by IMNCrew: Derp.org; country: US; sector: Consumer Services
  First observed: 2025-05-05.
references:
  - http://imncrewwfkbjkhr2oylerfm5qtbzfphhmpcfag43xc2kfgvluqtlgoid.onion
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
