title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-4905 — Event Log Clearing (play)'
id: f5f1934d-c7d0-56c7-b3dc-14db31ad61f3
status: deprecated
description: |
  Detects event log clearing associated with play ransomware.
  Incident: dragnet-ransomware-2025-4905
  Ransomware victim claim by play: Cool Wind Ventilation; country: US; sector: Manufacturing
  First observed: 2025-09-09.
references:
  - http://mbrlkbtq5jonaqkurjwmxftytyn2ethqvbxfu4rgjbkkknndqwae6byd.onion/index.php?page=1/topic.php?id=uBGNVX93A02sSS
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
