title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6974 — Event Log Clearing (safepay)'
id: 96cefe8a-d3c3-5189-aae1-f6098840e2e9
status: deprecated
description: |
  Detects event log clearing associated with safepay ransomware.
  Incident: dragnet-ransomware-2025-6974
  Ransomware victim claim by safepay: tele-optics.com; country: US; sector: Technology
  First observed: 2025-07-26.
references:
  - http://j3dp6okmaklajrsk6zljl5sfa2vpui7j2w6cwmhmmqhab6frdfbphhid.onion#tele-optics
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
