title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7448 — Event Log Clearing (spacebears)'
id: 20f85765-a27d-57af-8a78-b447361335ba
status: deprecated
description: |
  Detects event log clearing associated with spacebears ransomware.
  Incident: dragnet-ransomware-2025-7448
  Ransomware victim claim by spacebears: EBL PARTNERS (construction|interiors), Florida; country: US; sector: Business Services
  First observed: 2025-01-08.
references:
  - http://5butbkrljkaorg5maepuca25oma7eiwo6a2rlhvkblb4v6mf3ki2ovid.onion/companies/29/ebl-partners-constructioninteriors-florida
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
