title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-2615 — Shadow Copy Deletion (ElDorado)'
id: 42bf7cea-101f-502a-b55c-2c051ebef194
status: deprecated
description: |
  Detects shadow copy deletion commands associated with ElDorado ransomware.
  Incident: dragnet-ransomware-2025-2615
  Ransomware victim claim by ElDorado: Rees NDT Inspection Services; country: CA; sector: Manufacturing
  First observed: 2025-01-22.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
