title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3083 — Event Log Clearing (handala)'
id: 09f36cdf-c92a-5d2f-afd2-bc3ad0eb909d
status: deprecated
description: |
  Detects event log clearing associated with handala ransomware.
  Incident: dragnet-ransomware-2025-3083
  Ransomware victim claim by handala: Tosaf; country: NL; sector: Manufacturing
  First observed: 2025-02-02.
references:
  - https://handala-hack.to/tosaf-hacked/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
