title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5900 — Event Log Clearing (qilin)'
id: a20840f9-812c-5ebc-b343-e0488f456b7e
status: deprecated
description: |
  Detects event log clearing associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-5900
  Ransomware victim claim by qilin: Radiant Beauty Supplies; country: CA; sector: Consumer Services
  First observed: 2025-10-14.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=d6cf02bd-90d3-345b-a2af-af5f6f90fb33
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
