title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3563 — Shadow Copy Deletion (interlock)'
id: 3e399293-81fc-5b1e-bdd6-b2eca06e9e94
status: deprecated
description: |
  Detects shadow copy deletion commands associated with interlock ransomware.
  Incident: dragnet-ransomware-2025-3563
  Ransomware victim claim by interlock: CB Quality Machining & Engineering; country: US; sector: Manufacturing
  First observed: 2025-07-18.
references:
  - http://ebhmkoohccl45qesdbvrjqtyro2hmhkmh6vkyfyjjzfllm3ix72aqaid.onion/leaks.phphttp://u2qvcxl65guk4lxi2lyxq5zwlgnq7ojahihr4ipl7a3wcui6pvff7dyd.onion/index.php?p=
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
