title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5552 — Recovery Inhibition (qilin)'
id: 6d03a280-0c67-5a3d-a4fc-2f4599fa5189
status: deprecated
description: |
  Detects boot/recovery disabling associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-5552
  Ransomware victim claim by qilin: gmb.com; country: US; sector: Construction
  First observed: 2025-05-16.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=d37f7e12-669e-303c-b1db-e609cfe4f722
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
