title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0733 — Event Log Clearing (akira)'
id: f1c0158c-6c82-52d5-b74f-17ce328e6a89
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2025-0733
  Ransomware victim claim by akira: Tropical Foods Company Inc; country: US; sector: Agriculture and Food Production
  First observed: 2025-02-07.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
