title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-1360 — Shadow Copy Deletion (cactus)'
id: 79bb4988-7a0c-55c6-b173-ffdbfeb6edd1
status: deprecated
description: |
  Detects shadow copy deletion commands associated with cactus ransomware.
  Incident: dragnet-ransomware-2025-1360
  Ransomware victim claim by cactus: steelerubber.com; country: US; sector: Manufacturing
  First observed: 2025-02-05.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/STEELRUBBER
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
