title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-4323 — Event Log Clearing (medusa)'
id: 90350432-a244-5ce3-a84c-230183351b43
status: deprecated
description: |
  Detects event log clearing associated with medusa ransomware.
  Incident: dragnet-ransomware-2025-4323
  Ransomware victim claim by medusa: D & M Trim; country: US; sector: Construction
  First observed: 2025-01-20.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
