title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-3892 — Recovery Inhibition (kryptos)'
id: 3e731b6e-5582-53c4-802a-d2a2a908e8d5
status: deprecated
description: |
  Detects boot/recovery disabling associated with kryptos ransomware.
  Incident: dragnet-ransomware-2025-3892
  Ransomware victim claim by kryptos: Adichunchanagiri Institute Of Technology; country: IN; sector: Education
  First observed: 2025-10-24.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
