title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5387 — Event Log Clearing (qilin)'
id: 846f7cf3-44f3-5ed9-8ecb-d4cf3acc2d68
status: deprecated
description: |
  Detects event log clearing associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-5387
  Ransomware victim claim by qilin: cityofbelvedere.org; country: US; sector: Public Sector
  First observed: 2025-05-21.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=68578975-242b-3a0a-9700-b287938cf8e7
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
