title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-1376 — Recovery Inhibition (cephalus)'
id: 12adb729-1b53-5fd3-85e3-92d26270c05f
status: deprecated
description: |
  Detects boot/recovery disabling associated with cephalus ransomware.
  Incident: dragnet-ransomware-2025-1376
  Ransomware victim claim by cephalus: K Strategies Marketing and Public Relations; country: US; sector: Business Services
  First observed: 2025-08-26.
references:
  - https://darkforums.st/Thread-Document-K-Strategies-Marketing-and-Public-Relations-LEAK-900-GB
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
