title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0096 — Recovery Inhibition (akira)'
id: f0ac00e8-7798-529a-8694-2d6b934b45a4
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2025-0096
  Ransomware victim claim by akira: Apache OpenOffice; country: US; sector: Technology
  First observed: 2025-10-30.
references:
  - https://akiral2iz6a7qgd3ayp3l6yub7xx2uep76idk3u2kollpj5z3z636bad.onion/#apacheopenoffice
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
