title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-0668 — Recovery Inhibition (akira)'
id: 3be4da9f-551d-535e-ba57-57eeb1df64d8
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2025-0668
  Ransomware victim claim by akira: Stoss Landscape Urbanism; country: ES; sector: Construction
  First observed: 2025-11-19.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
