title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-5448 — Event Log Clearing (qilin)'
id: 0076944c-9645-594b-85ba-82340d201325
status: deprecated
description: |
  Detects event log clearing associated with qilin ransomware.
  Incident: dragnet-ransomware-2025-5448
  Ransomware victim claim by qilin: Doha British School; country: QA; sector: Education
  First observed: 2025-10-24.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=98013bad-da1a-397e-9aa9-b53c4e2de165
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
