title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7910 — Recovery Inhibition (worldleaks)'
id: 59b33ea9-8aed-5ea9-83a6-bea899888b7b
status: deprecated
description: |
  Detects boot/recovery disabling associated with worldleaks ransomware.
  Incident: dragnet-ransomware-2025-7910
  Ransomware victim claim by worldleaks: Somotsoft; country: US; sector: Technology
  First observed: 2025-07-02.
references:
  - https://worldleaksartrjm3c6vasllvgacbi5u3mgzkluehrzhk2jz4taufuid.onion/companies/7713818529
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
