title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7341 — Event Log Clearing (sinobi)'
id: 122bd6dd-7c7b-5ca7-9fb2-59b5b3e8733e
status: deprecated
description: |
  Detects event log clearing associated with sinobi ransomware.
  Incident: dragnet-ransomware-2025-7341
  Ransomware victim claim by sinobi: McDonald Building; sector: Construction
  First observed: 2025-10-17.
references:
  - http://sinobi6ftrg27d6g4sjdt65malds6cfptlnjyw52rskakqjda6uvb7yd.onion/leaks/68f2a07a88b6823fa2a12670
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
