title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-7915 — Recovery Inhibition (worldleaks)'
id: f4723634-9fe4-53c6-9573-488535867387
status: deprecated
description: |
  Detects boot/recovery disabling associated with worldleaks ransomware.
  Incident: dragnet-ransomware-2025-7915
  Ransomware victim claim by worldleaks: T.O. Brasil; country: BR; sector: Not Found
  First observed: 2025-05-15.
references:
  - https://worldleaksartrjm3c6vasllvgacbi5u3mgzkluehrzhk2jz4taufuid.onion/companies/4368228743
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
