title: 'Dragnet [Ransomware]: dragnet-ransomware-2025-6918 — Recovery Inhibition (safepay)'
id: a9ee191f-6e29-582f-8b98-87800bec5f40
status: deprecated
description: |
  Detects boot/recovery disabling associated with safepay ransomware.
  Incident: dragnet-ransomware-2025-6918
  Ransomware victim claim by safepay: realschule-karlstadt.org; country: DE; sector: Education
  First observed: 2025-04-24.
references:
  - http://j3dp6okmaklajrsk6zljl5sfa2vpui7j2w6cwmhmmqhab6frdfbphhid.onion#realschule
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
