title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0549 — Shadow Copy Deletion (dispossessor)'
id: f1ce3b0e-0df5-57dc-9ff5-981d9dcd6397
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2021-0549
  Ransomware victim claim by dispossessor: bluefin.com; sector: Technology
  First observed: 2021-01-10.
references:
  - https://dispossessor.com/blogs/102
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
