title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0031 — Recovery Inhibition (atomsilo)'
id: 123143b1-a6cb-5f62-9347-010c218095cb
status: deprecated
description: |
  Detects boot/recovery disabling associated with atomsilo ransomware.
  Incident: dragnet-ransomware-2021-0031
  Ransomware victim claim by atomsilo: LIGHT CONVERSION; sector: Manufacturing
  First observed: 2021-12-21.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
