title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0547 — Recovery Inhibition (dispossessor)'
id: 0e403914-3285-5144-b963-0f7f1e9adbea
status: deprecated
description: |
  Detects boot/recovery disabling associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2021-0547
  Ransomware victim claim by dispossessor: abbvie.com; sector: Healthcare
  First observed: 2021-03-08.
references:
  - https://dispossessor.com/blogs/175
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
