title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1342 — Recovery Inhibition (pysa)'
id: ce905307-0491-5a00-88e2-bb80750f66ae
status: deprecated
description: |
  Detects boot/recovery disabling associated with pysa ransomware.
  Incident: dragnet-ransomware-2021-1342
  Ransomware victim claim by pysa: D.W. Haber & Son; sector: Business Services
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
