title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0171 — Event Log Clearing (avaddon)'
id: f4364a60-d392-5a78-ad5e-8e3a1fce33b6
status: deprecated
description: |
  Detects event log clearing associated with avaddon ransomware.
  Incident: dragnet-ransomware-2021-0171
  Ransomware victim claim by avaddon: The Capital Medical Center; sector: Healthcare
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
