title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0773 — Event Log Clearing (lockbit2)'
id: 85a65def-1c90-5224-a023-45ebbe019478
status: deprecated
description: |
  Detects event log clearing associated with lockbit2 ransomware.
  Incident: dragnet-ransomware-2021-0773
  Ransomware victim claim by lockbit2: drhrlaw.com; sector: Business Services
  First observed: 2021-09-22.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
