title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1693 — Recovery Inhibition (ronggolawe)'
id: 8e938d9e-0b73-5982-8cbf-c62945bc1af9
status: deprecated
description: |
  Detects boot/recovery disabling associated with ronggolawe ransomware.
  Incident: dragnet-ransomware-2021-1693
  Ransomware victim claim by ronggolawe: Ministerio de Economía y Finanzas de Ecuador (Ecuador's Ministry of Finance); country: EC; sector: Public Sector
  First observed: 2021-02-01.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
