title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1328 — Recovery Inhibition (pysa)'
id: cd837537-1fc7-52e7-ab92-55718f1e2656
status: deprecated
description: |
  Detects boot/recovery disabling associated with pysa ransomware.
  Incident: dragnet-ransomware-2021-1328
  Ransomware victim claim by pysa: CHR Solutions; sector: Business Services
  First observed: 2021-12-06.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
