title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-1638 — Shadow Copy Deletion (ransomexx)'
id: 85ed7c75-33c1-53af-8129-0643c39815b5
status: deprecated
description: |
  Detects shadow copy deletion commands associated with ransomexx ransomware.
  Incident: dragnet-ransomware-2021-1638
  Ransomware victim claim by ransomexx: STEMCOR; sector: Manufacturing
  First observed: 2021-09-09.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
