title: 'Dragnet [Ransomware]: dragnet-ransomware-2021-0570 — Event Log Clearing (dispossessor)'
id: 088e8bd1-a7d2-5332-a7dd-027b262e5eb3
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2021-0570
  Ransomware victim claim by dispossessor: riteaid.com; sector: Business Services
  First observed: 2021-01-02.
references:
  - https://dispossessor.com/blogs/147
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
