title: 'Dragnet [Container]: dragnet-container-2026-2423 — Vulnerable Base Image Pull'
id: f46779fa-7923-5f8c-ae20-fa75770696d3
status: deprecated
description: |
  Detects deployment of a container image known to contain a critical vulnerability.
  Incident: dragnet-container-2026-2423 (Tier 2, CVSS 9.6)
  Unspecified vulnerability in Oracle Java SE 7u101 and 8u92 and Java SE Embedded 8u91 allows remote attackers to affect confidentiality, integrity, and availability via vectors related to Hotspot.
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2016-3606
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00011.html
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00024.html
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00032.html
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00033.html
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00034.html
  - http://lists.opensuse.org/opensuse-security-announce/2016-08/msg00035.html
  - http://lists.opensuse.org/opensuse-updates/2016-08/msg00028.html
  - http://rhn.redhat.com/errata/RHSA-2016-1504.html
  - http://rhn.redhat.com/errata/RHSA-2016-1776.html
  - http://www.debian.org/security/2016/dsa-3641
  - http://www.oracle.com/technetwork/security-advisory/cpujul2016-2881720.html
  - http://www.oracle.com/technetwork/security-advisory/cpujul2016-2881720.html#AppendixJAVA
  - http://www.oracle.com/technetwork/topics/security/linuxbulletinjul2016-3090544.html
  - http://www.securityfocus.com/bid/91787
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1610
  - attack.t1611
  - dragnet.cve
logsource:
  category: container_image_pull
detection:
  selection:
    Image|contains:
      - 'amazonlinux:1'
      - 'chainguard:'
      - 'debian:7'
      - 'debian:8'
      - 'oraclelinux:5'
      - 'oraclelinux:6'
      - 'oraclelinux:7'
      - 'ubuntu:12.04'
      - 'ubuntu:14.04'
      - 'ubuntu:15.10'
      - 'ubuntu:16.04'
      - 'ubuntu:16.04-ESM'
  condition: selection
falsepositives:
  - Cached images pulled before the vulnerability was published
  - Internal image mirrors that have not been updated
level: critical
