title: 'Dragnet [Container]: dragnet-container-2026-3585 — Vulnerable Base Image Pull'
id: 4e26a6c7-1693-58c3-a256-9d2bfaa64e35
status: deprecated
description: |
  Detects deployment of a container image known to contain a critical vulnerability.
  Incident: dragnet-container-2026-3585 (Tier 2, CVSS 9.6)
  A double-eviction in the Incognito mode cache that lead to a user-after-free in Networking Disk Cache in Google Chrome prior to 66.0.3359.117 allowed a remote attacker to execute arbitrary code via a crafted HTML page.
references:
  - http://www.securityfocus.com/bid/103917
  - https://access.redhat.com/errata/RHSA-2018:1195
  - https://access.redhat.com/security/cve/CVE-2018-6086
  - https://chromereleases.googleblog.com/2018/04/stable-channel-update-for-desktop.html
  - https://crbug.com/827492
  - https://nvd.nist.gov/vuln/detail/CVE-2018-6086
  - https://security.gentoo.org/glsa/201804-22
  - https://www.cve.org/CVERecord?id=CVE-2018-6086
  - https://www.debian.org/security/2018/dsa-4182
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1610
  - attack.t1611
  - dragnet.cve
logsource:
  category: container_image_pull
detection:
  selection:
    Image|contains:
      - 'debian:7'
      - 'debian:8'
      - 'debian:9'
      - 'ubuntu:16.04'
      - 'ubuntu:17.10'
      - 'ubuntu:18.04'
      - 'ubuntu:18.10'
  condition: selection
falsepositives:
  - Cached images pulled before the vulnerability was published
  - Internal image mirrors that have not been updated
level: high
