title: 'Dragnet [Container]: dragnet-container-2026-0440 — Vulnerable Base Image Pull'
id: 42614a00-a211-584f-bfc8-d0a318fd22f7
status: deprecated
description: |
  Detects deployment of a container image known to contain a critical vulnerability.
  Incident: dragnet-container-2026-0440 (Tier 2, CVSS 10)
  Multiple unspecified vulnerabilities in ClamAV before 0.94 have unknown impact and attack vectors related to file descriptor leaks on the "error path" in (1) libclamav/others.c and (2) libclamav/sis.c.
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2008-3914
  - http://kolab.org/security/kolab-vendor-notice-22.txt
  - http://lists.apple.com/archives/security-announce/2008/Oct/msg00001.html
  - http://lists.opensuse.org/opensuse-security-announce/2008-09/msg00004.html
  - http://secunia.com/advisories/31906
  - http://secunia.com/advisories/31982
  - http://secunia.com/advisories/32030
  - http://secunia.com/advisories/32222
  - http://secunia.com/advisories/32424
  - http://secunia.com/advisories/32699
  - http://security.gentoo.org/glsa/glsa-200809-18.xml
  - http://sourceforge.net/project/shownotes.php?group_id=86638&release_id=623661
  - http://support.apple.com/kb/HT3216
  - http://svn.clamav.net/svn/clamav-devel/trunk/ChangeLog
  - http://www.debian.org/security/2008/dsa-1660
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1610
  - attack.t1611
  - dragnet.cve
logsource:
  category: container_image_pull
detection:
  selection:
    Image|contains:
      - 'cbl-mariner:1.0'
      - 'debian:11'
      - 'debian:12'
      - 'debian:13'
      - 'debian:14'
  condition: selection
falsepositives:
  - Cached images pulled before the vulnerability was published
  - Internal image mirrors that have not been updated
level: critical
