title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-5267 — Shadow Copy Deletion (toufan)'
id: a54f7e7b-c545-56b9-b688-1704185380f4
status: deprecated
description: |
  Detects shadow copy deletion commands associated with toufan ransomware.
  Incident: dragnet-ransomware-2023-5267
  Ransomware victim claim by toufan: www.pts-tools.com; sector: Not Found
  First observed: 2023-12-19.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
