title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2100 — Event Log Clearing (dispossessor)'
id: 87376745-423c-51f9-a8eb-e13062bd7a4b
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2100
  Ransomware victim claim by dispossessor: greenside-sch.org; sector: Education
  First observed: 2023-08-29.
references:
  - https://dispossessor.com/blogs/912
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
