title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2189 — Event Log Clearing (dispossessor)'
id: 67e773e2-4227-5b6f-bae9-9aaa4be7e701
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2189
  Ransomware victim claim by dispossessor: tucsoneyecare.com; sector: Healthcare
  First observed: 2023-02-13.
references:
  - https://dispossessor.com/blogs/481
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
