title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1096 — Shadow Copy Deletion (bianlian)'
id: 43533359-630e-57ca-beb6-7a4ea69bb5be
status: deprecated
description: |
  Detects shadow copy deletion commands associated with bianlian ransomware.
  Incident: dragnet-ransomware-2023-1096
  Ransomware victim claim by bianlian: New Venture Escrow; sector: Financial Services
  First observed: 2023-09-10.
references:
  - http://bianlianlbc5an4kgnay3opdemgcryg2kpfcbgczopmm3dnbz3uaunad.onion//companies/newventureescrow.com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
