title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2096 — Shadow Copy Deletion (dispossessor)'
id: 96524a9e-7fd1-509f-b3bf-48af5938c42b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2096
  Ransomware victim claim by dispossessor: goodhopeholdings.com; country: MY; sector: Agriculture and Food Production
  First observed: 2023-11-16.
references:
  - https://dispossessor.com/blogs/1161
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
