title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4628 — Recovery Inhibition (ransomed)'
id: 3f322c41-f4d4-597b-956c-67b0d57845ab
status: deprecated
description: |
  Detects boot/recovery disabling associated with ransomed ransomware.
  Incident: dragnet-ransomware-2023-4628
  Ransomware victim claim by ransomed: Hawaii Health System; sector: Healthcare
  First observed: 2023-09-01.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
