title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2046 — Recovery Inhibition (dispossessor)'
id: 78a35085-5a43-5acd-b3d5-5b9c4285b403
status: deprecated
description: |
  Detects boot/recovery disabling associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2046
  Ransomware victim claim by dispossessor: brownintegratedlogistics.com; sector: Transportation/Logistics
  First observed: 2023-12-30.
references:
  - https://dispossessor.com/blogs/1273
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
