title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3526 — Event Log Clearing (lorenz)'
id: 1d3cf168-2371-5ba6-b0a6-6aaf29e313e2
status: deprecated
description: |
  Detects event log clearing associated with lorenz ransomware.
  Incident: dragnet-ransomware-2023-3526
  Ransomware victim claim by lorenz: Koh Brothers; sector: Not Found
  First observed: 2023-11-02.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
