title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2018 — Shadow Copy Deletion (devman)'
id: 0f59130b-3d8c-5f3d-9b78-0faad5820212
status: deprecated
description: |
  Detects shadow copy deletion commands associated with devman ransomware.
  Incident: dragnet-ransomware-2023-2018
  Ransomware victim claim by devman: newhorizonsmedical.org; country: US; sector: Healthcare
  First observed: 2023-06-07.
references:
  - http://devmanblggk7ddrtqj3tsocnayow3bwnozab2s4yhv4shpv6ueitjzid.onion#newhorizonsmedicalorg
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
