title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1468 — Event Log Clearing (cactus)'
id: bb75a31b-d92c-577d-90d0-0034af4d95e5
status: deprecated
description: |
  Detects event log clearing associated with cactus ransomware.
  Incident: dragnet-ransomware-2023-1468
  Ransomware victim claim by cactus: Italkraft; sector: Consumer Services
  First observed: 2023-07-20.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/ITALKRAFT
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
