title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1213 — Recovery Inhibition (blackbasta)'
id: d0de2abf-50c5-5741-b383-ef72f6f824f3
status: deprecated
description: |
  Detects boot/recovery disabling associated with blackbasta ransomware.
  Incident: dragnet-ransomware-2023-1213
  Ransomware victim claim by blackbasta: CORPADS_2; country: DE; sector: Manufacturing
  First observed: 2023-03-08.
references:
  - http://stniiomyjliimcgkvdszvgen3eaaoz55hreqqx6o77yvmpwt7gklffqd.onion/?id=Aurubis
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
