title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2323 — Event Log Clearing (hunters)'
id: 1a985b8b-4067-5c44-9ad5-7269d021b929
status: deprecated
description: |
  Detects event log clearing associated with hunters ransomware.
  Incident: dragnet-ransomware-2023-2323
  Ransomware victim claim by hunters: IDESA group, S.A. De C.V.; country: MX; sector: Energy
  First observed: 2023-11-12.
references:
  - https://hunters55rdxciehoqzwv7vgyv6nt37tbwax2reroyzxhou7my5ejyid.onion/companies/3647741060
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
