title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1512 — Shadow Copy Deletion (cactus)'
id: 9e639875-d445-5ad4-aca8-0d14ff9c1c15
status: deprecated
description: |
  Detects shadow copy deletion commands associated with cactus ransomware.
  Incident: dragnet-ransomware-2023-1512
  Ransomware victim claim by cactus: Trimaran Capital Partners; sector: Financial Services
  First observed: 2023-09-07.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/TRIMARAN
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
