title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3670 — Recovery Inhibition (malas)'
id: 17195ade-afdf-5466-a541-990d485aee29
status: deprecated
description: |
  Detects boot/recovery disabling associated with malas ransomware.
  Incident: dragnet-ransomware-2023-3670
  Ransomware victim claim by malas: Legato; sector: Business Services
  First observed: 2023-04-09.
references:
  - http://malas2urovbyyavjzaezkt5ohljvyd5lt7vv7mnsgbf2y4bwlh72doqd.onion/posts/defaulters/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
