title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2168 — Event Log Clearing (dispossessor)'
id: 7edb7ebe-7a30-5bd5-b61d-7ddfb0af35a7
status: deprecated
description: |
  Detects event log clearing associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2168
  Ransomware victim claim by dispossessor: sandycove.org; sector: Healthcare
  First observed: 2023-04-14.
references:
  - https://dispossessor.com/blogs/659
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
