title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3865 — Recovery Inhibition (medusa)'
id: 3096bc90-bb28-5ba6-a3a4-618f4c89de22
status: deprecated
description: |
  Detects boot/recovery disabling associated with medusa ransomware.
  Incident: dragnet-ransomware-2023-3865
  Ransomware victim claim by medusa: Native Counselling Services of Alberta; country: CA; sector: Public Sector
  First observed: 2023-10-23.
references:
  - http://medusaxko7jxtrojdkxo66j7ck4q5tgktf7uqsqyfry4ebnxlcbkccyd.onion/detail?id=f58fdce615a70c0ac52188568725e193
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
