title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3073 — Event Log Clearing (lockbit3)'
id: ad799cb3-b1f0-5b53-b564-ff9a58d8a4bf
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-3073
  Ransomware victim claim by lockbit3: microtrain.net; sector: Business Services
  First observed: 2023-11-03.
references:
  - http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/GIbDAhm1ZgVuQpTE65441a38b1be6
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
