title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-5357 — Event Log Clearing (werewolves)'
id: 02f4b226-5247-558e-970f-a5c056a26c4d
status: deprecated
description: |
  Detects event log clearing associated with werewolves ransomware.
  Incident: dragnet-ransomware-2023-5357
  Ransomware victim claim by werewolves: auditexpertnn.ru; country: RU; sector: Business Services
  First observed: 2023-11-02.
references:
  - https://werewolves.pro/en/promproektspb-ru.html
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
