title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4786 — Event Log Clearing (raznatovic)'
id: a60f21ae-4e82-501e-bb83-1f6d5be035de
status: deprecated
description: |
  Detects event log clearing associated with raznatovic ransomware.
  Incident: dragnet-ransomware-2023-4786
  Ransomware victim claim by raznatovic: TechKids aka MindX; sector: Education
  First observed: 2023-12-17.
references:
  - https://ransomed.vc/samo/TechKids.txt
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
