title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0573 — Event Log Clearing (alphv)'
id: 163c09eb-dc64-5580-9215-ed395b43c2ba
status: deprecated
description: |
  Detects event log clearing associated with alphv ransomware.
  Incident: dragnet-ransomware-2023-0573
  Ransomware victim claim by alphv: Eastin Hotel Makkasan Bangkok was hacked Customers' financial and personal information has; country: TH; sector: Hospitality and Tourism
  First observed: 2023-07-12.
references:
  - http://alphvmmm27o3abo3r2mlmjrpdmzle3rykajqc5xsj7j7ejksbpsa36ad.onion/93fe6640-8a5a-4fad-aa01-455ecad0a16b
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
