title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1382 — Event Log Clearing (blackbyte)'
id: 4da99b70-147b-5c49-99fb-6b356f38b37d
status: deprecated
description: |
  Detects event log clearing associated with blackbyte ransomware.
  Incident: dragnet-ransomware-2023-1382
  Associated with BlackByte.
  Ransomware victim claim by blackbyte: Kirby Risk; country: IN; sector: Business Services
  First observed: 2023-09-09.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
  - dragnet.actor.blackbyte
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
