title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1884 — Recovery Inhibition (clop)'
id: aea3450b-9090-5b19-8eb3-2025eb587036
status: deprecated
description: |
  Detects boot/recovery disabling associated with clop ransomware.
  Incident: dragnet-ransomware-2023-1884
  Ransomware victim claim by clop: SODALESSOLUTIONS.COM; sector: Business Services
  First observed: 2023-03-23.
references:
  - http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/sodalessolutions-com
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
