title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2840 — Event Log Clearing (lockbit3)'
id: 989af4ca-9c4c-5e87-b997-0db237dc49c9
status: deprecated
description: |
  Detects event log clearing associated with lockbit3 ransomware.
  Incident: dragnet-ransomware-2023-2840
  Ransomware victim claim by lockbit3: gormanusa.com; sector: Construction
  First observed: 2023-09-06.
references:
  - http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/YbY17TwAwxzbZXJq64f8edb459caa
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
