title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0387 — Recovery Inhibition (akira)'
id: e3c786af-85ae-5172-aadb-eebbd040816e
status: deprecated
description: |
  Detects boot/recovery disabling associated with akira ransomware.
  Incident: dragnet-ransomware-2023-0387
  Ransomware victim claim by akira: Pinnergy; country: MX; sector: Energy
  First observed: 2023-07-06.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
