title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-0427 — Event Log Clearing (akira)'
id: 1e378369-ae5b-54ee-96f7-566f039e44e5
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2023-0427
  Ransomware victim claim by akira: The McGregor; sector: Agriculture and Food Production
  First observed: 2023-05-03.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
