title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-1475 — Shadow Copy Deletion (cactus)'
id: f7d8676b-9ade-5c09-84f5-769d9c22ab0f
status: deprecated
description: |
  Detects shadow copy deletion commands associated with cactus ransomware.
  Incident: dragnet-ransomware-2023-1475
  Ransomware victim claim by cactus: Marfrig Global Foods; country: BR; sector: Agriculture and Food Production
  First observed: 2023-09-05.
references:
  - https://cactusbloguuodvqjmnzlwetjlpj6aggc6iocwhuupb47laukux7ckid.onion/posts/MARFRIG
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
