title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4741 — Event Log Clearing (raworld)'
id: 50f208eb-4bdf-5d56-bcad-6b27d7b71b3c
status: deprecated
description: |
  Detects event log clearing associated with raworld ransomware.
  Incident: dragnet-ransomware-2023-4741
  Ransomware victim claim by raworld: 2****r; sector: Not Found
  First observed: 2023-08-29.
references:
  - http://pa32ymaeu62yo5th5mraikgw5fcvznnsiiwti42carjliarodltmqcqd.onion/post/7585.html
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
