title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2261 — Event Log Clearing (dunghill)'
id: 1fc07c47-4736-5c55-808d-890b7490a6e1
status: deprecated
description: |
  Detects event log clearing associated with dunghill ransomware.
  Incident: dragnet-ransomware-2023-2261
  Ransomware victim claim by dunghill: Sabre Corporation; sector: Transportation/Logistics
  First observed: 2023-09-06.
references:
  - http://p66slxmtum2ox4jpayco6ai3qfehd5urgrs4oximjzklxcol264driqd.onion/lot5.html
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
