title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2028 — Recovery Inhibition (dispossessor)'
id: 4efe9f00-61b3-5879-8932-29354d1fea3c
status: deprecated
description: |
  Detects boot/recovery disabling associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2028
  Ransomware victim claim by dispossessor: andesaservices.com; sector: Technology
  First observed: 2023-08-27.
references:
  - https://dispossessor.com/blogs/241
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
