title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-2125 — Shadow Copy Deletion (dispossessor)'
id: 347c933d-6a5a-550e-a64b-18262bef7aba
status: deprecated
description: |
  Detects shadow copy deletion commands associated with dispossessor ransomware.
  Incident: dragnet-ransomware-2023-2125
  Ransomware victim claim by dispossessor: mdihospital.org; sector: Healthcare
  First observed: 2023-06-03.
references:
  - https://dispossessor.com/blogs/313
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
