title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3915 — Shadow Copy Deletion (medusa)'
id: b9db700c-9a6a-5575-bd5a-896b2f29ce22
status: deprecated
description: |
  Detects shadow copy deletion commands associated with medusa ransomware.
  Incident: dragnet-ransomware-2023-3915
  Ransomware victim claim by medusa: ZOUARY & Associés ; sector: Business Services
  First observed: 2023-10-12.
references:
  - http://medusaxko7jxtrojdkxo66j7ck4q5tgktf7uqsqyfry4ebnxlcbkccyd.onion/detail?id=5d945083bec0c84b20dccb25a49f8d2e
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
