title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-3757 — Recovery Inhibition (mallox)'
id: 7528d827-5046-5e5d-86cc-d632569ce3cb
status: deprecated
description: |
  Detects boot/recovery disabling associated with mallox ransomware.
  Incident: dragnet-ransomware-2023-3757
  Ransomware victim claim by mallox: Hydrofit Alliance Ltd; sector: Manufacturing
  First observed: 2023-02-16.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
