title: 'Dragnet [Ransomware]: dragnet-ransomware-2023-4659 — Recovery Inhibition (ransomed)'
id: cbb5ee31-d5f0-58cc-b0b3-29b8598755a5
status: deprecated
description: |
  Detects boot/recovery disabling associated with ransomed ransomware.
  Incident: dragnet-ransomware-2023-4659
  Ransomware victim claim by ransomed: PSM; sector: Not Found
  First observed: 2023-08-28.
references:
  - https://ransomed.vc/ps.html
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
