title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-3049 — Recovery Inhibition (tengu)'
id: 4c41999b-bc89-51a9-91ab-34909f33db99
status: deprecated
description: |
  Detects boot/recovery disabling associated with tengu ransomware.
  Incident: dragnet-ransomware-2026-3049
  Ransomware victim claim by tengu: FRUIT-BONTÉ Agroalimentaire; country: FR; sector: Agriculture and Food Production
  First observed: 2026-01-27.
references:
  - http://longcc4fqrfcqt5lzceutylaxir6h66fp6df3oin6mvwvz6pfdbxc6qd.onion/blog/4f79f41d4473a7f8988e6e4b8faad58d60cace55604e0c7b40d27f8bf55fef44/
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
