title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1512 — Recovery Inhibition (LeakBazaar)'
id: 50ec3e6e-654c-5a68-9dca-9759dd325fed
status: deprecated
description: |
  Detects boot/recovery disabling associated with LeakBazaar ransomware.
  Incident: dragnet-ransomware-2026-1512
  Ransomware victim claim by LeakBazaar: Gastroenterology & Hepatology; country: US; sector: Healthcare
  First observed: 2026-04-17.
references:
  - https://mes4qo4rd6t3biyrm6q4twkquspzd7r4kg7va765nbdfxqgnc2w3pead.onion/company?dataBlobId=d5f10299-088a-4fb6-b3cc-54c713acd3c0
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
