title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-0074 — Event Log Clearing (akira)'
id: 4d71a142-5a6d-5e42-af09-cb5b520d8b07
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2026-0074
  Ransomware victim claim by akira: COIT; country: US; sector: Consumer Services
  First observed: 2026-02-11.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
