title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1809 — Recovery Inhibition (nightspire)'
id: 2ea67c38-2c74-5387-9516-0459d721404d
status: deprecated
description: |
  Detects boot/recovery disabling associated with nightspire ransomware.
  Incident: dragnet-ransomware-2026-1809
  Ransomware victim claim by nightspire: *d**n*** V**i*l* **s**b***s; sector: Not Found
  First observed: 2026-03-20.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
