title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1634 — Shadow Copy Deletion (lockbit5)'
id: a15a190f-e726-5e57-b1ec-e9d88e67470b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with lockbit5 ransomware.
  Incident: dragnet-ransomware-2026-1634
  Ransomware victim claim by lockbit5: smilescare.com; country: US; sector: Healthcare
  First observed: 2026-02-17.
references:
  - http://lockbitapt67g6rwzjbcxnww5efpg4qok6vpfeth7wx3okj52ks4wtad.onion/post/0eab4e56ab479678799d02af01031a30
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
