title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1761 — Recovery Inhibition (morpheus)'
id: 9cfacb03-ddaf-5259-acb6-39cec585bfdd
status: deprecated
description: |
  Detects boot/recovery disabling associated with morpheus ransomware.
  Incident: dragnet-ransomware-2026-1761
  Ransomware victim claim by morpheus: SBCTANZANIA; country: TZ; sector: Agriculture and Food Production
  First observed: 2026-03-30.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
