title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-2358 — Shadow Copy Deletion (qilin)'
id: 8d3cf4cf-0694-5d0a-b0b6-e04f8b398d1b
status: deprecated
description: |
  Detects shadow copy deletion commands associated with qilin ransomware.
  Incident: dragnet-ransomware-2026-2358
  Ransomware victim claim by qilin: ELC Security Products; country: IL; sector: Not Found
  First observed: 2026-03-05.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=8d371143-900b-34e3-8d18-53a7f2defb2d
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
