title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-2572 — Event Log Clearing (qilin)'
id: f7c22870-5abe-5455-9bbf-266705540029
status: deprecated
description: |
  Detects event log clearing associated with qilin ransomware.
  Incident: dragnet-ransomware-2026-2572
  Ransomware victim claim by qilin: PGDIS.PAPETIQUE PRO; country: FR; sector: Manufacturing
  First observed: 2026-04-13.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/view?uuid=8d5d99b3-6280-345e-8701-3c0406c2f352
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
