title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-3334 — Recovery Inhibition (thegentlemen)'
id: 2715c555-3258-5754-bea5-e878afbd48d3
status: deprecated
description: |
  Detects boot/recovery disabling associated with thegentlemen ransomware.
  Incident: dragnet-ransomware-2026-3334
  Ransomware victim claim by thegentlemen: SETCAR; country: TN; sector: Transportation/Logistics
  First observed: 2026-05-12.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
