title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-2369 — Event Log Clearing (qilin)'
id: 674701de-d2c9-55fb-80e3-caa72e2b9e16
status: deprecated
description: |
  Detects event log clearing associated with qilin ransomware.
  Incident: dragnet-ransomware-2026-2369
  Ransomware victim claim by qilin: Exclusive Networks; country: FR; sector: Technology
  First observed: 2026-04-27.
references:
  - http://ijzn3sicrcy7guixkzjkib4ukbiilwc3xhnmby4mcbccnsd7j2rekvqd.onion/site/blog?uuid=00bee91c-d577-4927-8a0f-b8a6ea4b6d37
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
