title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-0128 — Event Log Clearing (akira)'
id: 76fbeb66-6e96-59ad-8911-6b6b739d41a9
status: deprecated
description: |
  Detects event log clearing associated with akira ransomware.
  Incident: dragnet-ransomware-2026-0128
  Ransomware victim claim by akira: Hrp Hitesh Cpa; country: US; sector: Financial Services
  First observed: 2026-02-19.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1070.001
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_wevtutil:
    Image|endswith: '\wevtutil.exe'
    CommandLine|contains:
      - ' cl '
      - ' clear-log '
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Clear-EventLog'
  condition: 1 of selection_*
falsepositives:
  - Legitimate log maintenance scripts
level: high
