title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1796 — Shadow Copy Deletion (nightspire)'
id: 8cddb4d5-7f81-5525-8b88-a0804f7ca615
status: deprecated
description: |
  Detects shadow copy deletion commands associated with nightspire ransomware.
  Incident: dragnet-ransomware-2026-1796
  Ransomware victim claim by nightspire: BrandingBusiness; country: US; sector: Business Services
  First observed: 2026-01-29.
references:
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
