title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-3306 — Shadow Copy Deletion (thegentlemen)'
id: 3e5e6191-d182-572b-8fa9-ace123dd5121
status: deprecated
description: |
  Detects shadow copy deletion commands associated with thegentlemen ransomware.
  Incident: dragnet-ransomware-2026-3306
  Ransomware victim claim by thegentlemen: PLUS Malaysia Berhad; country: MY; sector: Transportation/Logistics
  First observed: 2026-02-06.
references:
  - http://tezwsse5czllksjb7cwp65rvnk4oobmzti2znn42i43bjdfd2prqqkad.onion
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_vssadmin:
    Image|endswith: '\vssadmin.exe'
    CommandLine|contains|all:
      - 'delete'
      - 'shadows'
  selection_wmic:
    Image|endswith: '\wmic.exe'
    CommandLine|contains|all:
      - 'shadowcopy'
      - 'delete'
  selection_powershell:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains: 'Get-WmiObject Win32_ShadowCopy'
  condition: 1 of selection_*
falsepositives:
  - Legitimate backup solution maintenance (rare)
level: high
