title: 'Dragnet [Ransomware]: dragnet-ransomware-2026-1200 — Recovery Inhibition (incransom)'
id: cc5c5b38-1767-52db-adb3-469d51259aa8
status: deprecated
description: |
  Detects boot/recovery disabling associated with incransom ransomware.
  Incident: dragnet-ransomware-2026-1200
  Ransomware victim claim by incransom: cmswpc.com; country: US; sector: Business Services
  First observed: 2026-05-01.
references:
  - http://incblog6qu4y4mm4zvw5nrmue6qbwtgjsxpw6b7ixzssu36tsajldoad.onion/blog/disclosures/69fcf1d98f1d14b743b95793
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1490
  - dragnet.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection_bcdedit:
    Image|endswith: '\bcdedit.exe'
    CommandLine|contains:
      - 'recoveryenabled no'
      - 'bootstatuspolicy ignoreallfailures'
  condition: selection_bcdedit
falsepositives:
  - System administrators modifying boot configuration
level: high
