
title: 'Dragnet [IOC]: dragnet-supply-2026-5199 — C2 Network Communication'
id: 1499362b-2e8c-518f-b82c-27d801f2d5e9
status: test
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-5199
  First observed: 2026-01-23.
  Confidence: 80% (aikido).
references:
  - https://www.aikido.dev/blog/npm-supply-chain-phishing-campaigns
author: dragnet-bot
date: 2026-05-17
tags:
  - attack.t1071.001
  - attack.t1041
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://login.siemensergy.icu/DIVzTaSF'
      - 'https://login.siemens-energy.icu/DIVzTaSF'
      - 'https://cdn.jsdelivr.net/npm/flockiali@1.2.6/resp/template.min.js'
      - 'https://cdn.jsdelivr.net/npm/flockiali@1.2.5/resp/template.min.js'
      - 'https://cdn.jsdelivr.net/npm/opresc@1.0.0/resp/template.min.js'
      - 'https://cdn.jsdelivr.net/npm/prndn@1.0.0/template.min.js'
      - 'https://cdn.jsdelivr.net/npm/oprnm@1.0.0/resp/template.min.js'
      - 'https://cdn.jsdelivr.net/npm/operni@1.2.7/reps/template.min.js'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: medium
