
title: 'Dragnet [IOC]: dragnet-supply-2026-96603 — C2 Network Communication'
id: 62665174-37eb-54bd-9d48-49c144ecb29b
status: test
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-96603
  First observed: 2026-01-23.
  Confidence: 80% (aikido).
references:
  - https://www.aikido.dev/blog/npm-malware-g-wagon-python-stealer-crypto-wallets
author: dragnet-bot
date: 2026-05-16
tags:
  - attack.t1071.001
  - attack.t1041
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://nyc.cloud.appwrite.io/v1/storage/buckets/688625a0000f8a1b71e8/files/69732d9c000042399d88/view?project=6886229e003d46469fab'
      - 'https://fra.cloud.appwrite.io/v1/storage/buckets/6968ea5600316c128f22/files/69736838003349357574/view?project=6968e9e9000ee4ac710c'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: medium
