
title: 'Dragnet [IOC]: dragnet-supply-2026-214489 — C2 Network Communication'
id: 980a31c9-7119-5d9d-bbfd-00fc56496b6d
status: test
description: |
  Detects network connections to known C2 infrastructure associated with a supply chain incident.
  Incident: dragnet-supply-2026-214489
  First observed: 2026-02-16.
  Confidence: 80% (aikido).
references:
  - https://www.aikido.dev/blog/npm-backdoor-lets-hackers-hijack-gambling-outcomes
author: dragnet-bot
date: 2026-05-16
tags:
  - attack.t1071.001
  - attack.t1041
logsource:
  category: network_connection
  product: any
detection:
  selection_url:
    DestinationHostname|contains:
      - 'https://payment.y1pay.vip/v1/risk/get-risk-code'
      - 'https://payment.y1pay.vip/v1/risk/log'
      - 'https://payment.snip-site.cc'
      - 'https://gameland.21game.live'
      - 'https://gameland.myapptest.top/v1'
      - 'https://gameland.nbzysp1.com/v1'
      - 'https://gameland.21game.live/v1'
  condition: selection_url
falsepositives:
  - Legitimate traffic to shared infrastructure
level: medium
